/*
20.Елемент aj геометричної прогресії обчислюється по формулі:
aj = a0rj, j = 0, 1, 2,...
Поле first — дробове число, перший елемент прогресії a0; поле second —
постійне відношення r. Визначити метод elementj() для обчислення
заданого елемента прогресії.
*/
struct progression
{
private:
    double first; // перший елемент геометричної прогресії
    double second; // r

public:
    progression* Init(double f, double s); // метод  ініціалізації полей
    void Read();  //  метод для зчитування полей з потоку вводу
    void Display(); //  метод  для відображення полей в поток виводу
    double elementj(unsigned short j); // отримання (j + 1)-го елементу прогресії
};
